scottmotabiz/app/controllers/posts_controller.rb

  def show
    @post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE ("posts"."id" = 1) LIMIT 1

  def edit
    @post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE ("posts"."id" = 1) LIMIT 1

  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT "posts".* FROM "posts" WHERE ("posts"."id" = 5) LIMIT 1
UPDATE "posts" SET "content" = '<img src="http://localhost:3000/images/header_vww.jpg" width ="100px" />', "updated_at" = '2011-01-27 05:25:13.809159' WHERE ("posts"."id" = 5)

  def destroy
    @post = Post.find(params[:id])
    @post.destroy
---
SELECT "posts".* FROM "posts" WHERE ("posts"."id" = 3) LIMIT 1
DELETE FROM "posts" WHERE ("posts"."id" = 3)